export default {
  printWidth: 80,            // Максимальная длина строки
  tabWidth: 2,               // Ширина табуляции
  useTabs: false,            // Использовать табуляции вместо пробелов
  semi: true,                // Ставить точку с запятой в конце строк
  singleQuote: true,         // Использовать одинарные кавычки вместо двойных
  trailingComma: 'es5',      // Добавлять запятую в конце последнего элемента в ES5
  bracketSpacing: true,      // Пробелы между фигурными скобками и содержимым
  arrowParens: 'always',     // Всегда добавлять скобки вокруг аргументов стрелочных функций
  endOfLine: 'lf',           // Конец строки — перевод строки LF
};